# Lecture

In [1]:
import pandas as pd

## Series

In [2]:
s = pd.Series((1,2,3,4,5))
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [4]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
import numpy as np
randn = np.random.randn

In [6]:
s = pd.Series(randn(3),('a','b','c'))
s

a    0.435930
b   -1.666787
c    1.872852
dtype: float64

In [7]:
s.mean()

0.21399838505143443

In [8]:
dict(s)

{'a': 0.43593042670213783, 'b': -1.6667869134072428, 'c': 1.8728516418594083}

In [9]:
pd.Series(dict(s))

a    0.435930
b   -1.666787
c    1.872852
dtype: float64

In [10]:
s

a    0.435930
b   -1.666787
c    1.872852
dtype: float64

In [11]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
s.reindex(['c','b','a'])

c    1.872852
b   -1.666787
a    0.435930
dtype: float64

In [13]:
s + s

a    0.871861
b   -3.333574
c    3.745703
dtype: float64

In [14]:
np.mean(s)

0.21399838505143443

## DataFrame

In [15]:
d = {'ONE': s*s, 'TWO': s+s}
df = pd.DataFrame(d)
df

        ONE       TWO
a  0.190035  0.871861
b  2.778179 -3.333574
c  3.507573  3.745703

In [16]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [17]:
df.columns

Index(['ONE', 'TWO'], dtype='object')

In [18]:
df['THREE'] = s * 3
df

        ONE       TWO     THREE
a  0.190035  0.871861  1.307791
b  2.778179 -3.333574 -5.000361
c  3.507573  3.745703  5.618555

In [19]:
df.ONE

a    0.190035
b    2.778179
c    3.507573
Name: ONE, dtype: float64

In [20]:
df['ONE']

a    0.190035
b    2.778179
c    3.507573
Name: ONE, dtype: float64

In [21]:
df.reindex(['c','b','a'])

        ONE       TWO     THREE
c  3.507573  3.745703  5.618555
b  2.778179 -3.333574 -5.000361
a  0.190035  0.871861  1.307791

In [22]:
df.drop('c')

        ONE       TWO     THREE
a  0.190035  0.871861  1.307791
b  2.778179 -3.333574 -5.000361

In [23]:
df.drop(['b','a'])

        ONE       TWO     THREE
c  3.507573  3.745703  5.618555

In [39]:
df

        ONE       TWO     THREE
a  0.190035  0.871861  1.307791
b  2.778179 -3.333574 -5.000361
c  3.507573  3.745703  5.618555

In [38]:
df.sort_values(['TWO'],axis=0)

        ONE       TWO     THREE
b  2.778179 -3.333574 -5.000361
a  0.190035  0.871861  1.307791
c  3.507573  3.745703  5.618555

In [24]:
df.mean()

ONE      2.158596
TWO      0.427997
THREE    0.641995
dtype: float64

In [25]:
raw_data1 = {
        'student_id': [111, 222, 333, 444, 555],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Anna'], 
        'last_name': ['Anderson', 'Brown', 'Green', 'White', 'Smith']}
df_a = pd.DataFrame(raw_data1, columns = ['student_id', 'first_name', 'last_name'])
df_a

   student_id first_name last_name
0         111       Alex  Anderson
1         222        Amy     Brown
2         333      Allen     Green
3         444      Alice     White
4         555       Anna     Smith

In [29]:
raw_data2 = {
        'sid': [111, 111, 111, 333, 333, 444, 666],
        'course_name': ['Calculus', 'Chemistry', 'Biology', 'Physics', 'Statistics','Piano','Guitar']}
df_b = pd.DataFrame(raw_data2, columns = ['sid', 'course_name'])
df_b

   sid course_name
0  111    Calculus
1  111   Chemistry
2  111     Biology
3  333     Physics
4  333  Statistics
5  444       Piano
6  666      Guitar

In [30]:
pd.merge(df_a, df_b, left_on='student_id', right_on='sid', how='outer')

   student_id first_name last_name    sid course_name
0       111.0       Alex  Anderson  111.0    Calculus
1       111.0       Alex  Anderson  111.0   Chemistry
2       111.0       Alex  Anderson  111.0     Biology
3       222.0        Amy     Brown    NaN         NaN
4       333.0      Allen     Green  333.0     Physics
5       333.0      Allen     Green  333.0  Statistics
6       444.0      Alice     White  444.0       Piano
7       555.0       Anna     Smith    NaN         NaN
8         NaN        NaN       NaN  666.0      Guitar

In [31]:
s[0]

0.43593042670213783

In [32]:
list(df.ONE)

[0.19003533692470798, 2.7781786147056438, 3.5075732724154816]